package main.Part_four_SpringMVC;

public class Lesson_41_SpringMVCForm {
    // Мы уже работали с формами в одной из предыдущих лекций. Однако мы работали напрямую с
    // HTML. В SpringMVC существуют готовые реализации форм, с ними мы и познакомимся.

    // В этой лекции мы создадим три формы отвечающих за имя, фамилию и зарплату работника,
    // передадим эти данные в model, а после, обработав, выведем в финальном view.

    // Для начала о том в каком виде мы будем передавать данные.
    // Мы на протяжении всего курса, все же изучаем Spring, а значит было бы неплохо воспользоваться
    // им для нашей лекции. Что мы сделаем? Мы создадим бин Employee, полями определим необходимые
    // нам переменные, имя, фамилию, зарплату. Потом этот бин передадим в model, а уже оттуда
    // будем пользоваться так, как нам угодно.

    // Приступим. Создадим класс Employee(пока класс). Там ничего интересного пока для нас.
    // Несколько полей, пустой конструктор, геттеры, сеттеры, toString().

    // Далее мы создали новый контролер MySecondController, перейдем в него.
}
