<!--Здесь все просто, там где мы хотим увидеть информацию, которую ввели, мы должны обратиться
к переменной куда все это сохранили. Для этого используется такой синтаксис который мы там видим.
Обращаемся к информации которую сохранили через переменную param, это Map в который ключом
передалось название переменной, а значением то, что мы ввели в поле. Теперь мы можем запустить
сервер и проверить как все работает.-->
<!DOCTYPE html>
<html>
<body>
<h2>Dear Employee, you are WELCOME!</h2>
<br>
<br>
<br>
Your name: ${nameAttribute}
</body>
</html>